/*

*/

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __SENSORS_H
#define __SENSORS_H

#ifdef __cplusplus
extern "C" {
#endif
// --------------------------------------------
#include "main.h"
	
//******************************************************************************
// Секция include: здесь подключаются заголовочные файлы используемых модулей
//******************************************************************************
#include <math.h>
#include <stdio.h>
#include <stdint.h>	
//******************************************************************************
// Секция определения констант
//******************************************************************************
//#define MY_CONST1 1
//#define MY_CONST2 2
//******************************************************************************
// Секция определения типов
//******************************************************************************
typedef struct
{
uint8_t D1; 	// Датчик аварийной температуры топливоподачи 0-ff 
uint8_t D2; 	// Датчик уровня топлива в бункере 0-ff
double D3;	// Датчик температуры теплоносителя в подаче (нормированная в Цельсиях)	
uint8_t D4; 	// Капиллярный термостат безопасности котла
double D5;	// Датчик температуры теплоносителя в обратке (нормированная в Цельсиях)
double D6;	// Датчик температуры ГВС (нормированная в Кельвинах)
double D7;	// Датчик температуры окружающей среды (нормированная в Цельсиях)	
uint8_t D8; 	// Датчик комнатный термостат
double D10;	//	Датчик температуры отходящих газов (нормированная в Цельсиях)
uint8_t A1;		//	Входной сигнал от внешней аварии
} T_SENSORS;


//******************************************************************************
// Секция определения глобальных переменных
//******************************************************************************

//******************************************************************************
// Секция прототипов глобальных функций
//******************************************************************************
 T_SENSORS sensors_poll(void);

//******************************************************************************
// Секция определения макросов
//******************************************************************************
//#define MACRO1
//#define MACRO2

#ifdef __cplusplus
}
#endif

#endif /* __SENSORS_H */

