/*
Sensors functions 
*/
//******************************************************************************
// Секция include: здесь подключается заголовочный файл к модулю
//******************************************************************************
#include "sensors.h"
#include "ds18b20.h"
#include "main.h"
//******************************************************************************
// Секция определения переменных, используемых в модуле
//******************************************************************************
//------------------------------------------------------------------------------
// Глобальные
//------------------------------------------------------------------------------
// 0- D3(Температура теплоносителя в подаче) 
// 1- D5(Температура теплоносителя в обратке) 
// 2- D6(Температура ГВС), 3- D7(Датчик температуры окружающей среды)
// 4- D10(Датчик температуры отходящих газов) 
extern uint16_t ADC_Data[8];
//------------------------------------------------------------------------------
// Локальные
//------------------------------------------------------------------------------
// Константы температурного преобразования ADC --> *C
const double T0 = 298; 		// Температура 25 градусов Цельсия  в кельвинах
const double Uop = 3.3; 	// Опорное напряжение АЦП

// Терморезистор датчика D3
const double Bt3 = 3944; 	// B константа для термистора
const double R03 = 10000; // Сопротивление термистора при температуре 25 градусов цельсия
const double R3 = 9500;  	// Сопротивление подстроечного резистора
const double Lt3 = 13.23 - 0.05;	// = log(R/R0) + Bt/T0;
// Терморезистор датчика D5
const double Bt5 = 3944; 	// B константа для термистора
const double R05 = 10000; // Сопротивление термистора при температуре 25 градусов цельсия
const double R5 = 9000;  	// Сопротивление подстроечного резистора
const double Lt5 = 13.23 - 0.1;	// = log(R/R0) + Bt/T0;
// Терморезистор датчика D6
const double Bt6 = 3944; 	// B константа для термистора
const double R06 = 10000; // Сопротивление термистора при температуре 25 градусов цельсия
const double R6 = 10000;  // Сопротивление подстроечного резистора
const double Lt6 = 13.23;	// = log(R/R0) + Bt/T0;
// Терморезистор датчика D7
const double Bt7 = 3944; 	// B константа для термистора
const double R07 = 10000; // Сопротивление термистора при температуре 25 градусов цельсия
const double R7 = 10000;  // Сопротивление подстроечного резистора
const double Lt7 = 13.23;	// = log(R/R0) + Bt/T0;

const double Kedc = 24571; // коэффициент термопары 24390--25000 .. 24691
const double Kusil = 80;   // Коэффициент усиления ОУ
const double omega = -257 ;  // Поправочный коэффициент на сдвиг нуля в ОУ LM358
//const uint16_t omega = 1146; // Поправочный коэффициент на сдвиг нуля в ОУ LM358 в единицах АЦП
//******************************************************************************
// Секция прототипов локальных функций
//******************************************************************************
double convertADCToTemperature(uint16_t adc, double bt, double lt);
double convertADCToTemperatureU(uint16_t adc);
//******************************************************************************
// Секция описания функций (сначала глобальных, потом локальных)
//******************************************************************************
 
// Опрос сенсоров бинарных 5 шт. A1,D1,D2,D4,D8 
// 5 шт. аналоговых D3,D5,D6,D7,D10
// НОРМА =0 , АВАРИЯ !=0
T_SENSORS sensors_poll(void)
{
T_SENSORS loc_sensors;

	if (HAL_GPIO_ReadPin(A1_GPIO_Port, A1_Pin) == GPIO_PIN_SET) loc_sensors.A1 = 0xFF;
	else loc_sensors.A1 = 0x00;
	
	if (HAL_GPIO_ReadPin(D1_GPIO_Port, D1_Pin) == GPIO_PIN_SET) loc_sensors.D1 = 0xFF;
	else loc_sensors.D1 = 0x00;
	
	if (HAL_GPIO_ReadPin(D2_GPIO_Port, D2_Pin) == GPIO_PIN_SET) loc_sensors.D2 = 0xFF;
	else loc_sensors.D2 = 0x00;
	
	if (HAL_GPIO_ReadPin(D4_GPIO_Port, D4_Pin) == GPIO_PIN_SET) loc_sensors.D4 = 0xFF;
	else loc_sensors.D4 = 0x00;
	
	if (HAL_GPIO_ReadPin(D8_GPIO_Port, D8_Pin) == GPIO_PIN_SET) loc_sensors.D8 = 0xFF;
	else loc_sensors.D8 = 0x00;
	// Опрос каналов АЦП здесь должны быть сделаны преобразования для приведения
	// значений АЦП в температуру в цельсиях.
	loc_sensors.D3 = convertADCToTemperature(ADC_Data[0], Bt3, Lt3); 
	loc_sensors.D5 = convertADCToTemperature(ADC_Data[1], Bt5, Lt5);
	loc_sensors.D6 = convertADCToTemperature(ADC_Data[2], Bt6, Lt6);
	loc_sensors.D7 = convertADCToTemperature(ADC_Data[3], Bt7, Lt7);
	
 loc_sensors.D10 = convertADCToTemperatureU(ADC_Data[4]);
	
return loc_sensors;
}
// ----- Преобразование показаний АЦП в температуру для терморезистора 
double convertADCToTemperature(uint16_t adc, double bt, double lt)
{
	double DC = (double)(adc);
	double temperature = bt/(lt + log((1 - DC/4095.0f)*(4095.0f/DC))) - 273.0f;
	return temperature; 
}	
// ----- Преобразование показаний АЦП в температуру для термопары
double convertADCToTemperatureU(uint16_t adc)
{
	double DC = (double)(adc);
//	double K = 3.3f/4095.0f;
	double  temperature  = 0.11f*DC - 96.0f; // (double)powf((float)(DC*K + omega), 1.1f); // сдвиг по шкале? причина? 1/8.33
	return temperature; 
}	
//******************************************************************************
// ENF OF FILE
//******************************************************************************

